{
  "transform_params" : {
    "input_1" : {
      "bias_a" : 0,
      "bias_g" : -1,
      "bias_r" : -1,
      "bias_b" : -1,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 0.0078740157186985016
    }
  },
  "properties" : {

  },
  "analyses" : {

  },
  "format_version" : 200,
  "storage" : "model.espresso.weights",
  "layers" : [
    {
      "name" : "functional_1\/reflection_padding2d\/MirrorPad_pad",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 3,
      "pad_r" : 3,
      "pad_b" : 3,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "input_1",
      "pad_l" : 3,
      "debug_info" : "functional_1\/reflection_padding2d\/MirrorPad_pad",
      "pad_value" : 0,
      "top" : "functional_1\/reflection_padding2d\/MirrorPad_pad"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "functional_1\/conv2d\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "functional_1\/conv2d\/Conv2Dx",
      "blob_weights" : 1,
      "K" : 3,
      "name" : "functional_1\/conv2d\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "functional_1\/reflection_padding2d\/MirrorPad_pad",
      "weights" : {

      },
      "Nx" : 7,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "functional_1\/conv2d\/Conv2Dx",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "functional_1\/conv2d\/Conv2D",
      "top" : "functional_1\/conv2d\/Conv2D",
      "type" : "transpose",
      "name" : "functional_1\/conv2d\/Conv2D"
    },
    {
      "top" : "functional_1\/conv2d\/BiasAdd\/ReadVariableOp",
      "w" : 64,
      "h" : 1,
      "name" : "functional_1\/conv2d\/BiasAdd\/ReadVariableOp",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "functional_1\/conv2d\/BiasAdd\/ReadVariableOp",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 3
    },
    {
      "bottom" : "functional_1\/conv2d\/Conv2D,functional_1\/conv2d\/BiasAdd\/ReadVariableOp",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/conv2d\/BiasAdd",
      "nd_mode" : true,
      "top" : "functional_1\/conv2d\/BiasAdd",
      "type" : "elementwise",
      "name" : "functional_1\/conv2d\/BiasAdd",
      "beta" : 0
    },
    {
      "axis_mode" : 4,
      "bottom" : "functional_1\/conv2d\/BiasAdd",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization\/Mean",
      "use_version" : 1,
      "top" : "functional_1\/conv2d\/BiasAdd1",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization\/Mean0"
    },
    {
      "axis_mode" : 2,
      "bottom" : "functional_1\/conv2d\/BiasAdd1",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 2,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization\/Mean",
      "use_version" : 1,
      "top" : "functional_1\/instance_normalization\/Mean",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization\/Mean"
    },
    {
      "axis_mode" : 4,
      "bottom" : "functional_1\/conv2d\/BiasAdd",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/Mean",
      "use_version" : 1,
      "top" : "functional_1\/conv2d\/BiasAdd1",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/Mean0"
    },
    {
      "axis_mode" : 2,
      "bottom" : "functional_1\/conv2d\/BiasAdd1",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 2,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/Mean",
      "use_version" : 1,
      "top" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/Mean",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/Mean"
    },
    {
      "bottom" : "functional_1\/conv2d\/BiasAdd,functional_1\/instance_normalization\/Mean",
      "alpha" : 1,
      "operation" : 33,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization\/sub",
      "nd_mode" : true,
      "top" : "functional_1\/instance_normalization\/sub",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization\/sub",
      "beta" : 0
    },
    {
      "bottom" : "functional_1\/conv2d\/BiasAdd,functional_1\/instance_normalization\/reduce_std\/reduce_variance\/Mean",
      "alpha" : 1,
      "operation" : 33,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/sub",
      "nd_mode" : true,
      "top" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/sub",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/sub",
      "beta" : 0
    },
    {
      "bottom" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/sub",
      "alpha" : 2,
      "operation" : 13,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/Square",
      "top" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/Square",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/Square",
      "beta" : 0
    },
    {
      "axis_mode" : 4,
      "bottom" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/Square",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/Mean_1",
      "use_version" : 1,
      "top" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/Square1",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/Mean_10"
    },
    {
      "axis_mode" : 2,
      "bottom" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/Square1",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 2,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/Mean_1",
      "use_version" : 1,
      "top" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/Mean_1",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/Mean_1"
    },
    {
      "bottom" : "functional_1\/instance_normalization\/reduce_std\/reduce_variance\/Mean_1",
      "alpha" : 1,
      "operation" : 11,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization\/reduce_std\/Sqrt",
      "top" : "functional_1\/instance_normalization\/reduce_std\/Sqrt",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization\/reduce_std\/Sqrt",
      "beta" : 0
    },
    {
      "bottom" : "functional_1\/instance_normalization\/reduce_std\/Sqrt",
      "alpha" : 9.9999997171806854e-10,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization\/add",
      "top" : "functional_1\/instance_normalization\/add",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization\/add",
      "beta" : 0
    },
    {
      "bottom" : "functional_1\/instance_normalization\/sub,functional_1\/instance_normalization\/add",
      "alpha" : 1,
      "operation" : 102,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization\/truediv",
      "nd_mode" : true,
      "top" : "functional_1\/instance_normalization\/truediv",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization\/truediv",
      "beta" : 0
    },
    {
      "top" : "functional_1\/instance_normalization\/Reshape",
      "w" : 64,
      "h" : 1,
      "name" : "functional_1\/instance_normalization\/Reshape",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "functional_1\/instance_normalization\/Reshape",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 5
    },
    {
      "bottom" : "functional_1\/instance_normalization\/truediv,functional_1\/instance_normalization\/Reshape",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization\/mul",
      "nd_mode" : true,
      "top" : "functional_1\/instance_normalization\/mul",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization\/mul",
      "beta" : 0
    },
    {
      "top" : "functional_1\/instance_normalization\/Reshape_1",
      "w" : 64,
      "h" : 1,
      "name" : "functional_1\/instance_normalization\/Reshape_1",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "functional_1\/instance_normalization\/Reshape_1",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 7
    },
    {
      "bottom" : "functional_1\/instance_normalization\/mul,functional_1\/instance_normalization\/Reshape_1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization\/add_1",
      "nd_mode" : true,
      "top" : "functional_1\/instance_normalization\/add_1",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization\/add_1",
      "beta" : 0
    },
    {
      "bottom" : "functional_1\/instance_normalization\/add_1",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "functional_1\/activation\/Relu",
      "top" : "functional_1\/activation\/Relu",
      "type" : "activation",
      "name" : "functional_1\/activation\/Relu"
    },
    {
      "axis_h" : 2,
      "axis_w" : 1,
      "bottom" : "functional_1\/activation\/Relu",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "functional_1\/reflection_padding2d_1\/MirrorPad_transpose_1",
      "top" : "functional_1\/reflection_padding2d_1\/MirrorPad_transpose_1",
      "type" : "transpose",
      "name" : "functional_1\/reflection_padding2d_1\/MirrorPad_transpose_1"
    },
    {
      "name" : "functional_1\/reflection_padding2d_1\/MirrorPad_pad",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "functional_1\/reflection_padding2d_1\/MirrorPad_transpose_1",
      "pad_l" : 1,
      "debug_info" : "functional_1\/reflection_padding2d_1\/MirrorPad_pad",
      "pad_value" : 0,
      "top" : "functional_1\/reflection_padding2d_1\/MirrorPad_pad"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "functional_1\/conv2d_1\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "functional_1\/conv2d_1\/BiasAdd",
      "blob_weights" : 11,
      "K" : 64,
      "blob_biases" : 9,
      "stride_x" : 2,
      "name" : "functional_1\/conv2d_1\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "functional_1\/reflection_padding2d_1\/MirrorPad_pad",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "functional_1\/reflection_padding2d_2\/MirrorPad_pad",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "functional_1\/conv2d_1\/BiasAdd",
      "pad_l" : 1,
      "debug_info" : "functional_1\/reflection_padding2d_2\/MirrorPad_pad",
      "pad_value" : 0,
      "top" : "functional_1\/reflection_padding2d_2\/MirrorPad_pad"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "functional_1\/conv2d_2\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "functional_1\/conv2d_2\/Conv2Dx",
      "blob_weights" : 13,
      "K" : 128,
      "name" : "functional_1\/conv2d_2\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "functional_1\/reflection_padding2d_2\/MirrorPad_pad",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "functional_1\/conv2d_2\/Conv2Dx",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "functional_1\/conv2d_2\/Conv2D",
      "top" : "functional_1\/conv2d_2\/Conv2D",
      "type" : "transpose",
      "name" : "functional_1\/conv2d_2\/Conv2D"
    },
    {
      "top" : "functional_1\/conv2d_2\/BiasAdd\/ReadVariableOp",
      "w" : 128,
      "h" : 1,
      "name" : "functional_1\/conv2d_2\/BiasAdd\/ReadVariableOp",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "functional_1\/conv2d_2\/BiasAdd\/ReadVariableOp",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 15
    },
    {
      "bottom" : "functional_1\/conv2d_2\/Conv2D,functional_1\/conv2d_2\/BiasAdd\/ReadVariableOp",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/conv2d_2\/BiasAdd",
      "nd_mode" : true,
      "top" : "functional_1\/conv2d_2\/BiasAdd",
      "type" : "elementwise",
      "name" : "functional_1\/conv2d_2\/BiasAdd",
      "beta" : 0
    },
    {
      "axis_mode" : 4,
      "bottom" : "functional_1\/conv2d_2\/BiasAdd",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization_1\/Mean",
      "use_version" : 1,
      "top" : "functional_1\/conv2d_2\/BiasAdd1",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization_1\/Mean0"
    },
    {
      "axis_mode" : 2,
      "bottom" : "functional_1\/conv2d_2\/BiasAdd1",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 2,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization_1\/Mean",
      "use_version" : 1,
      "top" : "functional_1\/instance_normalization_1\/Mean",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization_1\/Mean"
    },
    {
      "axis_mode" : 4,
      "bottom" : "functional_1\/conv2d_2\/BiasAdd",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/Mean",
      "use_version" : 1,
      "top" : "functional_1\/conv2d_2\/BiasAdd1",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/Mean0"
    },
    {
      "axis_mode" : 2,
      "bottom" : "functional_1\/conv2d_2\/BiasAdd1",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 2,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/Mean",
      "use_version" : 1,
      "top" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/Mean",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/Mean"
    },
    {
      "bottom" : "functional_1\/conv2d_2\/BiasAdd,functional_1\/instance_normalization_1\/Mean",
      "alpha" : 1,
      "operation" : 33,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_1\/sub",
      "nd_mode" : true,
      "top" : "functional_1\/instance_normalization_1\/sub",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_1\/sub",
      "beta" : 0
    },
    {
      "bottom" : "functional_1\/conv2d_2\/BiasAdd,functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/Mean",
      "alpha" : 1,
      "operation" : 33,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/sub",
      "nd_mode" : true,
      "top" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/sub",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/sub",
      "beta" : 0
    },
    {
      "bottom" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/sub",
      "alpha" : 2,
      "operation" : 13,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/Square",
      "top" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/Square",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/Square",
      "beta" : 0
    },
    {
      "axis_mode" : 4,
      "bottom" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/Square",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/Mean_1",
      "use_version" : 1,
      "top" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/Square1",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/Mean_10"
    },
    {
      "axis_mode" : 2,
      "bottom" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/Square1",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 2,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/Mean_1",
      "use_version" : 1,
      "top" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/Mean_1",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/Mean_1"
    },
    {
      "bottom" : "functional_1\/instance_normalization_1\/reduce_std\/reduce_variance\/Mean_1",
      "alpha" : 1,
      "operation" : 11,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_1\/reduce_std\/Sqrt",
      "top" : "functional_1\/instance_normalization_1\/reduce_std\/Sqrt",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_1\/reduce_std\/Sqrt",
      "beta" : 0
    },
    {
      "bottom" : "functional_1\/instance_normalization_1\/reduce_std\/Sqrt",
      "alpha" : 9.9999997171806854e-10,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_1\/add",
      "top" : "functional_1\/instance_normalization_1\/add",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_1\/add",
      "beta" : 0
    },
    {
      "bottom" : "functional_1\/instance_normalization_1\/sub,functional_1\/instance_normalization_1\/add",
      "alpha" : 1,
      "operation" : 102,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_1\/truediv",
      "nd_mode" : true,
      "top" : "functional_1\/instance_normalization_1\/truediv",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_1\/truediv",
      "beta" : 0
    },
    {
      "top" : "functional_1\/instance_normalization_1\/Reshape",
      "w" : 128,
      "h" : 1,
      "name" : "functional_1\/instance_normalization_1\/Reshape",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "functional_1\/instance_normalization_1\/Reshape",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 17
    },
    {
      "bottom" : "functional_1\/instance_normalization_1\/truediv,functional_1\/instance_normalization_1\/Reshape",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_1\/mul",
      "nd_mode" : true,
      "top" : "functional_1\/instance_normalization_1\/mul",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_1\/mul",
      "beta" : 0
    },
    {
      "top" : "functional_1\/instance_normalization_1\/Reshape_1",
      "w" : 128,
      "h" : 1,
      "name" : "functional_1\/instance_normalization_1\/Reshape_1",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "functional_1\/instance_normalization_1\/Reshape_1",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 19
    },
    {
      "bottom" : "functional_1\/instance_normalization_1\/mul,functional_1\/instance_normalization_1\/Reshape_1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_1\/add_1",
      "nd_mode" : true,
      "top" : "functional_1\/instance_normalization_1\/add_1",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_1\/add_1",
      "beta" : 0
    },
    {
      "bottom" : "functional_1\/instance_normalization_1\/add_1",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "functional_1\/activation_1\/Relu",
      "top" : "functional_1\/activation_1\/Relu",
      "type" : "activation",
      "name" : "functional_1\/activation_1\/Relu"
    },
    {
      "axis_h" : 2,
      "axis_w" : 1,
      "bottom" : "functional_1\/activation_1\/Relu",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "functional_1\/reflection_padding2d_3\/MirrorPad_transpose_1",
      "top" : "functional_1\/reflection_padding2d_3\/MirrorPad_transpose_1",
      "type" : "transpose",
      "name" : "functional_1\/reflection_padding2d_3\/MirrorPad_transpose_1"
    },
    {
      "name" : "functional_1\/reflection_padding2d_3\/MirrorPad_pad",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "functional_1\/reflection_padding2d_3\/MirrorPad_transpose_1",
      "pad_l" : 1,
      "debug_info" : "functional_1\/reflection_padding2d_3\/MirrorPad_pad",
      "pad_value" : 0,
      "top" : "functional_1\/reflection_padding2d_3\/MirrorPad_pad"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "functional_1\/conv2d_3\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "functional_1\/conv2d_3\/BiasAdd",
      "blob_weights" : 23,
      "K" : 128,
      "blob_biases" : 21,
      "stride_x" : 2,
      "name" : "functional_1\/conv2d_3\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "functional_1\/reflection_padding2d_3\/MirrorPad_pad",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "functional_1\/reflection_padding2d_4\/MirrorPad_pad",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "functional_1\/conv2d_3\/BiasAdd",
      "pad_l" : 1,
      "debug_info" : "functional_1\/reflection_padding2d_4\/MirrorPad_pad",
      "pad_value" : 0,
      "top" : "functional_1\/reflection_padding2d_4\/MirrorPad_pad"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "functional_1\/conv2d_4\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "functional_1\/conv2d_4\/Conv2Dx",
      "blob_weights" : 25,
      "K" : 256,
      "name" : "functional_1\/conv2d_4\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 256,
      "bottom" : "functional_1\/reflection_padding2d_4\/MirrorPad_pad",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "functional_1\/conv2d_4\/Conv2Dx",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "functional_1\/conv2d_4\/Conv2D",
      "top" : "functional_1\/conv2d_4\/Conv2D",
      "type" : "transpose",
      "name" : "functional_1\/conv2d_4\/Conv2D"
    },
    {
      "top" : "functional_1\/conv2d_4\/BiasAdd\/ReadVariableOp",
      "w" : 256,
      "h" : 1,
      "name" : "functional_1\/conv2d_4\/BiasAdd\/ReadVariableOp",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "functional_1\/conv2d_4\/BiasAdd\/ReadVariableOp",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 27
    },
    {
      "bottom" : "functional_1\/conv2d_4\/Conv2D,functional_1\/conv2d_4\/BiasAdd\/ReadVariableOp",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/conv2d_4\/BiasAdd",
      "nd_mode" : true,
      "top" : "functional_1\/conv2d_4\/BiasAdd",
      "type" : "elementwise",
      "name" : "functional_1\/conv2d_4\/BiasAdd",
      "beta" : 0
    },
    {
      "axis_mode" : 4,
      "bottom" : "functional_1\/conv2d_4\/BiasAdd",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization_2\/Mean",
      "use_version" : 1,
      "top" : "functional_1\/conv2d_4\/BiasAdd1",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization_2\/Mean0"
    },
    {
      "axis_mode" : 2,
      "bottom" : "functional_1\/conv2d_4\/BiasAdd1",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 2,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization_2\/Mean",
      "use_version" : 1,
      "top" : "functional_1\/instance_normalization_2\/Mean",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization_2\/Mean"
    },
    {
      "axis_mode" : 4,
      "bottom" : "functional_1\/conv2d_4\/BiasAdd",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/Mean",
      "use_version" : 1,
      "top" : "functional_1\/conv2d_4\/BiasAdd1",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/Mean0"
    },
    {
      "axis_mode" : 2,
      "bottom" : "functional_1\/conv2d_4\/BiasAdd1",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 2,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/Mean",
      "use_version" : 1,
      "top" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/Mean",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/Mean"
    },
    {
      "bottom" : "functional_1\/conv2d_4\/BiasAdd,functional_1\/instance_normalization_2\/Mean",
      "alpha" : 1,
      "operation" : 33,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_2\/sub",
      "nd_mode" : true,
      "top" : "functional_1\/instance_normalization_2\/sub",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_2\/sub",
      "beta" : 0
    },
    {
      "bottom" : "functional_1\/conv2d_4\/BiasAdd,functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/Mean",
      "alpha" : 1,
      "operation" : 33,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/sub",
      "nd_mode" : true,
      "top" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/sub",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/sub",
      "beta" : 0
    },
    {
      "bottom" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/sub",
      "alpha" : 2,
      "operation" : 13,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/Square",
      "top" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/Square",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/Square",
      "beta" : 0
    },
    {
      "axis_mode" : 4,
      "bottom" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/Square",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/Mean_1",
      "use_version" : 1,
      "top" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/Square1",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/Mean_10"
    },
    {
      "axis_mode" : 2,
      "bottom" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/Square1",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 2,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/Mean_1",
      "use_version" : 1,
      "top" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/Mean_1",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/Mean_1"
    },
    {
      "bottom" : "functional_1\/instance_normalization_2\/reduce_std\/reduce_variance\/Mean_1",
      "alpha" : 1,
      "operation" : 11,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_2\/reduce_std\/Sqrt",
      "top" : "functional_1\/instance_normalization_2\/reduce_std\/Sqrt",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_2\/reduce_std\/Sqrt",
      "beta" : 0
    },
    {
      "bottom" : "functional_1\/instance_normalization_2\/reduce_std\/Sqrt",
      "alpha" : 9.9999997171806854e-10,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_2\/add",
      "top" : "functional_1\/instance_normalization_2\/add",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_2\/add",
      "beta" : 0
    },
    {
      "bottom" : "functional_1\/instance_normalization_2\/sub,functional_1\/instance_normalization_2\/add",
      "alpha" : 1,
      "operation" : 102,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_2\/truediv",
      "nd_mode" : true,
      "top" : "functional_1\/instance_normalization_2\/truediv",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_2\/truediv",
      "beta" : 0
    },
    {
      "top" : "functional_1\/instance_normalization_2\/Reshape",
      "w" : 256,
      "h" : 1,
      "name" : "functional_1\/instance_normalization_2\/Reshape",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "functional_1\/instance_normalization_2\/Reshape",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 29
    },
    {
      "bottom" : "functional_1\/instance_normalization_2\/truediv,functional_1\/instance_normalization_2\/Reshape",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_2\/mul",
      "nd_mode" : true,
      "top" : "functional_1\/instance_normalization_2\/mul",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_2\/mul",
      "beta" : 0
    },
    {
      "top" : "functional_1\/instance_normalization_2\/Reshape_1",
      "w" : 256,
      "h" : 1,
      "name" : "functional_1\/instance_normalization_2\/Reshape_1",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "functional_1\/instance_normalization_2\/Reshape_1",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 31
    },
    {
      "bottom" : "functional_1\/instance_normalization_2\/mul,functional_1\/instance_normalization_2\/Reshape_1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_2\/add_1",
      "nd_mode" : true,
      "top" : "functional_1\/instance_normalization_2\/add_1",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_2\/add_1",
      "beta" : 0
    },
    {
      "bottom" : "functional_1\/instance_normalization_2\/add_1",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "functional_1\/activation_2\/Relu",
      "top" : "functional_1\/activation_2\/Relu",
      "type" : "activation",
      "name" : "functional_1\/activation_2\/Relu"
    },
    {
      "axis_h" : 2,
      "axis_w" : 1,
      "bottom" : "functional_1\/activation_2\/Relu",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "functional_1\/reflection_padding2d_5\/MirrorPad_transpose_1",
      "top" : "functional_1\/reflection_padding2d_5\/MirrorPad_transpose_1",
      "type" : "transpose",
      "name" : "functional_1\/reflection_padding2d_5\/MirrorPad_transpose_1"
    },
    {
      "name" : "functional_1\/reflection_padding2d_5\/MirrorPad_pad",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "functional_1\/reflection_padding2d_5\/MirrorPad_transpose_1",
      "pad_l" : 1,
      "debug_info" : "functional_1\/reflection_padding2d_5\/MirrorPad_pad",
      "pad_value" : 0,
      "top" : "functional_1\/reflection_padding2d_5\/MirrorPad_pad"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "functional_1\/conv2d_5\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "functional_1\/conv2d_5\/Conv2Dx",
      "blob_weights" : 33,
      "K" : 256,
      "name" : "functional_1\/conv2d_5\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 256,
      "bottom" : "functional_1\/reflection_padding2d_5\/MirrorPad_pad",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "functional_1\/conv2d_5\/Conv2Dx",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "functional_1\/conv2d_5\/Conv2D",
      "top" : "functional_1\/conv2d_5\/Conv2D",
      "type" : "transpose",
      "name" : "functional_1\/conv2d_5\/Conv2D"
    },
    {
      "top" : "functional_1\/conv2d_5\/BiasAdd\/ReadVariableOp",
      "w" : 256,
      "h" : 1,
      "name" : "functional_1\/conv2d_5\/BiasAdd\/ReadVariableOp",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "functional_1\/conv2d_5\/BiasAdd\/ReadVariableOp",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 35
    },
    {
      "bottom" : "functional_1\/conv2d_5\/Conv2D,functional_1\/conv2d_5\/BiasAdd\/ReadVariableOp",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/conv2d_5\/BiasAdd",
      "nd_mode" : true,
      "top" : "functional_1\/conv2d_5\/BiasAdd",
      "type" : "elementwise",
      "name" : "functional_1\/conv2d_5\/BiasAdd",
      "beta" : 0
    },
    {
      "axis_mode" : 4,
      "bottom" : "functional_1\/conv2d_5\/BiasAdd",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization_3\/Mean",
      "use_version" : 1,
      "top" : "functional_1\/conv2d_5\/BiasAdd1",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization_3\/Mean0"
    },
    {
      "axis_mode" : 2,
      "bottom" : "functional_1\/conv2d_5\/BiasAdd1",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 2,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization_3\/Mean",
      "use_version" : 1,
      "top" : "functional_1\/instance_normalization_3\/Mean",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization_3\/Mean"
    },
    {
      "axis_mode" : 4,
      "bottom" : "functional_1\/conv2d_5\/BiasAdd",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/Mean",
      "use_version" : 1,
      "top" : "functional_1\/conv2d_5\/BiasAdd1",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/Mean0"
    },
    {
      "axis_mode" : 2,
      "bottom" : "functional_1\/conv2d_5\/BiasAdd1",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 2,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/Mean",
      "use_version" : 1,
      "top" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/Mean",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/Mean"
    },
    {
      "bottom" : "functional_1\/conv2d_5\/BiasAdd,functional_1\/instance_normalization_3\/Mean",
      "alpha" : 1,
      "operation" : 33,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_3\/sub",
      "nd_mode" : true,
      "top" : "functional_1\/instance_normalization_3\/sub",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_3\/sub",
      "beta" : 0
    },
    {
      "bottom" : "functional_1\/conv2d_5\/BiasAdd,functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/Mean",
      "alpha" : 1,
      "operation" : 33,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/sub",
      "nd_mode" : true,
      "top" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/sub",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/sub",
      "beta" : 0
    },
    {
      "bottom" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/sub",
      "alpha" : 2,
      "operation" : 13,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/Square",
      "top" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/Square",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/Square",
      "beta" : 0
    },
    {
      "axis_mode" : 4,
      "bottom" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/Square",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/Mean_1",
      "use_version" : 1,
      "top" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/Square1",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/Mean_10"
    },
    {
      "axis_mode" : 2,
      "bottom" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/Square1",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 2,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/Mean_1",
      "use_version" : 1,
      "top" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/Mean_1",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/Mean_1"
    },
    {
      "bottom" : "functional_1\/instance_normalization_3\/reduce_std\/reduce_variance\/Mean_1",
      "alpha" : 1,
      "operation" : 11,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_3\/reduce_std\/Sqrt",
      "top" : "functional_1\/instance_normalization_3\/reduce_std\/Sqrt",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_3\/reduce_std\/Sqrt",
      "beta" : 0
    },
    {
      "bottom" : "functional_1\/instance_normalization_3\/reduce_std\/Sqrt",
      "alpha" : 9.9999997171806854e-10,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_3\/add",
      "top" : "functional_1\/instance_normalization_3\/add",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_3\/add",
      "beta" : 0
    },
    {
      "bottom" : "functional_1\/instance_normalization_3\/sub,functional_1\/instance_normalization_3\/add",
      "alpha" : 1,
      "operation" : 102,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_3\/truediv",
      "nd_mode" : true,
      "top" : "functional_1\/instance_normalization_3\/truediv",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_3\/truediv",
      "beta" : 0
    },
    {
      "top" : "functional_1\/instance_normalization_3\/Reshape",
      "w" : 256,
      "h" : 1,
      "name" : "functional_1\/instance_normalization_3\/Reshape",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "functional_1\/instance_normalization_3\/Reshape",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 37
    },
    {
      "bottom" : "functional_1\/instance_normalization_3\/truediv,functional_1\/instance_normalization_3\/Reshape",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_3\/mul",
      "nd_mode" : true,
      "top" : "functional_1\/instance_normalization_3\/mul",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_3\/mul",
      "beta" : 0
    },
    {
      "top" : "functional_1\/instance_normalization_3\/Reshape_1",
      "w" : 256,
      "h" : 1,
      "name" : "functional_1\/instance_normalization_3\/Reshape_1",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "functional_1\/instance_normalization_3\/Reshape_1",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 39
    },
    {
      "bottom" : "functional_1\/instance_normalization_3\/mul,functional_1\/instance_normalization_3\/Reshape_1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/instance_normalization_3\/add_1",
      "nd_mode" : true,
      "top" : "functional_1\/instance_normalization_3\/add_1",
      "type" : "elementwise",
      "name" : "functional_1\/instance_normalization_3\/add_1",
      "beta" : 0
    },
    {
      "bottom" : "functional_1\/instance_normalization_3\/add_1",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "functional_1\/activation_3\/Relu",
      "top" : "functional_1\/activation_3\/Relu",
      "type" : "activation",
      "name" : "functional_1\/activation_3\/Relu"
    },
    {
      "axis_h" : 2,
      "axis_w" : 1,
      "bottom" : "functional_1\/activation_3\/Relu",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "functional_1\/reflection_padding2d_6\/MirrorPad_transpose_1",
      "top" : "functional_1\/reflection_padding2d_6\/MirrorPad_transpose_1",
      "type" : "transpose",
      "name" : "functional_1\/reflection_padding2d_6\/MirrorPad_transpose_1"
    },
    {
      "name" : "functional_1\/reflection_padding2d_6\/MirrorPad_pad",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "functional_1\/reflection_padding2d_6\/MirrorPad_transpose_1",
      "pad_l" : 1,
      "debug_info" : "functional_1\/reflection_padding2d_6\/MirrorPad_pad",
      "pad_value" : 0,
      "top" : "functional_1\/reflection_padding2d_6\/MirrorPad_pad"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "functional_1\/conv2d_6\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "functional_1\/conv2d_6\/Conv2Dx",
      "blob_weights" : 41,
      "K" : 256,
      "name" : "functional_1\/conv2d_6\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 256,
      "bottom" : "functional_1\/reflection_padding2d_6\/MirrorPad_pad",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "functional_1\/conv2d_6\/Conv2Dx",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "functional_1\/conv2d_6\/Conv2D",
      "top" : "functional_1\/conv2d_6\/Conv2D",
      "type" : "transpose",
      "name" : "functional_1\/conv2d_6\/Conv2D"
    },
    {
      "top" : "functional_1\/conv2d_6\/BiasAdd\/ReadVariableOp",
      "w" : 256,
      "h" : 1,
      "name" : "functional_1\/conv2d_6\/BiasAdd\/ReadVariableOp",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "functional_1\/conv2d_6\/BiasAdd\/ReadVariableOp",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 43
    },
    {
      "bottom" : "functional_1\/conv2d_6\/Conv2D,functional_1\/conv2d_6\/BiasAdd\/ReadVariableOp",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "functional_1\/conv2d_6\/BiasAdd",
      "nd_mode" : true,
      "top" : "functional_1\/conv2d_6\/BiasAdd",
      "type" : "elementwise",
      "name" : "functional_1\/conv2d_6\/BiasAdd",
      "beta" : 0
    },
    {
      "axis_mode" : 4,
      "bottom" : "functional_1\/conv2d_6\/BiasAdd",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization_4\/Mean",
      "use_version" : 1,
      "top" : "functional_1\/conv2d_6\/BiasAdd1",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization_4\/Mean0"
    },
    {
      "axis_mode" : 2,
      "bottom" : "functional_1\/conv2d_6\/BiasAdd1",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 2,
      "nd_mode" : true,
      "debug_info" : "functional_1\/instance_normalization_4\/Mean",
      "use_version" : 1,
      "top" : "functional_1\/instance_normalization_4\/Mean",
      "type" : "reduce",
      "name" : "functional_1\/instance_normalization_4\/Mean"
    },
    {
      "axis_mode" : 4,
      "bottom" : "functional_1\/conv2d_6\/BiasAdd",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
